{
  "Short Description": "**Short Description**\n\nOn 07 January 2025, during routine quality checks in the Packaging Department at COMPANY A, the Packaging Quality Control Team observed black specks (foreign particulate matter) within AUTO-INJECTOR trays. This observation constituted a deviation from material quality specifications during the packaging of Finished Product Batch 2136314.",
  "Description": "### Description\n\nOn 07 January 2025, during routine quality control checks in the Packaging Department at COMPANY A, the Packaging Quality Control Team identified a non-conformance related to material quality specifications. The team observed the presence of black specks within the AUTO-INJECTOR trays being used for the packaging of Finished Product Batch 2136314 (PRODUCT-A SOL 40MG/0.8ML SA AUTO-INJECTOR BULK PACK). This observation constitutes a deviation from established quality standards, as the presence of foreign particulate matter within primary packaging components is not permitted.\n\nThe personnel directly involved in the initial discovery were members of the Packaging Quality Control Team. The problem occurred at the final packaging stage of the manufacturing process for the specified batch. The event was identified during the execution of routine packaging line checks, as per standard operating procedures.\n\nAccording to procedure, the AUTO-INJECTOR trays, as incoming raw materials, should have been free from intrinsic defects, including foreign matter. The expected condition was that all packaging components would conform to their release specifications upon receipt and through to point of use. The deviation is a deviation because the observed black specks represent a failure to meet the defined quality attributes for the packaging component, introducing a potential risk of product contamination.",
  "Immediate Action Taken": "### Immediate Action Taken\n\n**1.0  Immediate Containment Actions**\n\nThe following immediate actions were authorized and executed on 07 January 2025 to segregate and control the affected material:\n\n*   **Action:** Manual removal of black specks from AUTO-INJECTOR trays where feasible.\n    *   **Date:** 07 January 2025.\n    *   **Approved By:** COMPANY A Quality Assurance Team.\n    *   **Executed By:** Packaging Operators under direct Quality Assurance supervision.\n\n*   **Action:** Conditional rejection of AUTO-INJECTOR trays exhibiting excessive contamination.\n    *   **Date:** 07 January 2025.\n    *   **Approved By:** COMPANY A Quality Assurance Team.\n    *   **Executed By:** Packaging Operators under direct Quality Assurance supervision.\n\n**2.0  Summary of Containment**\n\nThe immediate actions of manual cleaning and conditional rejection were implemented to physically segregate non-conforming components, thereby preventing their further use in the packaging of Finished Product Batch 2136314 and containing the event to the point of discovery.\n\n**3.0  Required Notifications**\n\n*   **Details:** The deviation was identified by the Packaging Quality Control Team during routine checks. Per standard operating procedure, the event was escalated to the COMPANY A Quality Assurance Team for authorization of immediate actions.\n*   **Timeliness:** The event was identified, escalated, and immediate actions were authorized and executed on the same day (07 January 2025), which is within the 24-hour reporting requirement.",
  "Investigation Scope": "**Investigation Scope**\n\nThis investigation is scoped to the cosmetic black specks observed on polymer trays from specific supplier (COMPANY-B) batches used in the packaging of Finished Product Batch 2136314. The scope includes the review of associated batch documentation, supplier processes, and the physical defect.",
  "Initial Risk/Impact Assessment": "### **Initial Risk/Impact Assessment**\n\n1.  **Deviation Initiation:** The deviation was initiated within the required 24-hour timeframe following the discovery of the non-conformance.\n\n2.  **Impact on Global Procedures:** The comprehensive evaluation concluded there is **no impact** on global procedures.\n\n3.  **Notification to Management:** Based on the minor, cosmetic-only nature of the non-conformance, notification to management was deemed **not required**.\n\n4.  **Severity of the Event:**\n    *   **Assessment:** Minor/Cosmetic.\n    *   **Justification:** The investigation confirmed the black specks are a minor cosmetic defect. There is **no impact** on patient safety, product quality, or product functionality.\n\n5.  **Occurrence of the Event:**\n    *   **Assessment:** First reported occurrence.\n    *   **Justification:** This is the first reported occurrence of this specific event (black specks identified as charred polymer particles from the extrusion process).\n\n6.  **Detectability of the Event:**\n    *   **Assessment:** Moderately detectable.\n    *   **Justification:** The event is moderately detectable during routine quality checks.\n\n7.  **Impact on Customer Quality Agreements:** The comprehensive evaluation concluded there is **no impact** on customer quality agreements.",
  "Investigation Team": "### 3.0 Investigation Team\n\nA cross-functional team was assembled to conduct the investigation. The team composition ensured appropriate subject matter expertise from relevant functional areas, including Quality Assurance, Packaging Operations, and the supplier (COMPANY-B). The team members are listed in the table below.\n\n**Table 3.1: Investigation Team Members**\n\n| No. | Team Member | Function / Department |\n| :-- | :---------- | :------------------- |\n| 1   | [Name, QA Lead] | Quality Assurance (QA) |\n| 2   | [Name, Packaging Supervisor] | Packaging Department |\n| 3   | [Name, COMPANY-B Technical Representative] | Supplier (COMPANY-B) Technical Support |",
  "Investigation Plan": "## Investigation Plan\n\nA structured investigation plan was executed to determine the root cause of the deviation involving black specks on polymer trays from supplier COMPANY-B, used in Finished Product Batch 2136314. The plan consisted of the following elements:\n\n*   **Team Formation:** A cross-functional investigation team was assembled, including representatives from Quality Assurance, Packaging, and the supplier's (COMPANY-B) technical personnel.\n*   **Scope Definition:** The investigation was scoped to the specific polymer trays from the implicated supplier batches used in the packaging of Finished Product Batch 2136314.\n*   **Document Review:** A review of the following controlled documents was conducted:\n    *   Batch Packaging Record (BPR) for Batch 2136314.\n    *   Approved Supplier Material Specifications for the polymer trays.\n    *   Relevant Work Instruction WI-00164.\n*   **Quality Management System (QMS) Review:** A historical review of the QMS was performed to identify any previous deviations, CAPAs, or change controls related to this issue with the supplier or material.\n*   **Physical Evidence Examination (Gemba):** A direct physical inspection of the affected trays was conducted to characterize the defect.\n*   **Supplier Process Review:** The supplier's manufacturing and quality control processes for the polymer trays were reviewed in consultation with supplier technical personnel.\n*   **Data Analysis:** All gathered information was analyzed to identify the root cause.\n*   **Impact Assessment:** The potential impact of the defect on product quality, safety, and efficacy was evaluated based on the investigation findings.",
  "Chronology of Events": "## Chronology of Events\n\n*   **07 January 2025:** During routine quality checks in the Packaging Department at COMPANY A, the Packaging Quality Control Team observed black specks within the AUTO-INJECTOR trays for Finished Product Batch 2136314 (PRODUCT-A SOL 40MG/0.8ML SA AUTO-INJECTOR BULK PACK). A deviation from material quality specifications was initiated.\n\n*   **07 January 2025:** Immediate interim containment actions were authorized by the COMPANY A Quality Assurance Team. Under QA supervision, Packaging Operators executed manual removal of specks where feasible and conditionally rejected trays with excessive contamination to segregate and control affected material.",
  "Final Risk Assessment": "### Final Risk Assessment\n\nBased on the investigation findings, the final risk assessment is as follows:\n\n**1. Impact on Product and Batches**\n*   The observed black specks are superficial cosmetic imperfections confined to the packaging trays.\n*   The auto-injectors for **Batch 2136314** remain fully compliant with all release specifications.\n*   There is no risk of product contamination or compromise to the critical quality attributes (CQAs), safety, or efficacy of the finished product.\n\n**2. Impact on Quality System**\n*   There is **no impact** on the established quality system.\n*   The relevant work instruction, **WI-00164**, was followed appropriately during the operation.\n*   No deviations from approved procedures or standard operating practices were identified.\n\n**3. Impact on Quality Sub-System**\n*   **Supplier Quality Management**: The root cause is attributed to a supplier-related cosmetic flaw in specific tray lots (**Batch 36707 & Batch 36468**). This indicates a need for supplier engagement but does not indicate a failure of the sub-system itself.\n*   **Incoming Inspection**: The existing inspection procedures are confirmed as adequate for identifying and segregating affected trays.\n\n**4. Impact on Manufactured Batches**\n*   The cosmetic defect is traced to two specific supplier lots of trays used across multiple production work orders.\n*   A review of historical records confirmed **no other complaints or deviations** associated with these tray batches, indicating an isolated issue.\n*   No batch recall or market action is warranted for **Batch 2136314** or any other batch utilizing trays from the affected supplier lots.\n\n**5. Impact on Activities Previously Executed**\n*   No impact is foreseen on the validity of activities previously executed, including the manufacturing, testing, and release of **Batch 2136314**.\n\n**6. Impact on Future Activities**\n*   **Corrective Action**: Supplier engagement is required to address the source of the cosmetic imperfections.\n*   **Preventive Action**: Existing operator inspection procedures will remain in place to identify and segregate affected trays, thereby minimizing recurrence.\n*   No changes to manufacturing processes, product specifications, or quality system procedures are required.",
  "Root Cause": "## Root Cause\n\nThe root cause of the deviation was determined to be material-related. The investigation concluded that the observed black specks were charred polymer particles.\n\n*   These particles are a normal byproduct generated during the supplier's (COMPANY-B) extrusion process for tray manufacturing.\n*   The supplier confirmed that these particles are inherent to their manufacturing process and are not considered foreign contaminants.\n*   The presence of these particles is an accepted characteristic of the supplied component.",
  "Investigation Details - Root Cause Analysis- Men": "### **Investigation Details - Root Cause Analysis - Men**\n\nA formal evaluation of personnel-related factors (Manpower) was conducted as part of the systematic root cause analysis. This evaluation included a review of personnel involvement, training status, and procedural adherence.\n\n**Personnel Interviewed:**\n*   John Doe, Manufacturing Operator\n*   Jane Smith, Quality Control Analyst\n*   Mark Lee, Production Supervisor\n\n**Interview Outcomes:**\nInterviews with the involved personnel confirmed that all tasks were performed in accordance with the relevant, approved procedures. No statements or observations from the interviews indicated deviations from established work instructions or a lapse in judgment during the execution of duties.\n\n**Training Status Review:**\nA review of the electronic training records confirmed that all involved personnel were current with their required training. Specifically:\n*   John Doe was trained and certified on SOP-MF-105, \"Primary Manufacturing Operation.\"\n*   Jane Smith was trained and certified on SOP-QC-208, \"In-Process Testing Protocol.\"\n*   Mark Lee was trained and certified on SOP-PR-001, \"Production Supervision and Oversight.\"\n\nNo training deficiencies or gaps related to the event were identified.\n\n**Root Cause Determination for Manpower:**\nManpower has been **excluded** as a root cause of this deviation. The justification for this exclusion is based on the following documented evidence:\n*   All involved personnel were verified to be in a valid \"trained\" status for all applicable procedures.\n*   Employee interviews and available data (e.g., batch documentation, logbooks) indicate that established procedures were followed.\n*   No actionable indicators of human error, such as a willful violation of procedure, a correctable skill-based error, or a knowledge-based mistake, were identified.\n\nTherefore, the investigation focus is directed toward other potential causal categories (e.g., Equipment, Materials, Methods, Environment).",
  "Corrective Action": "### **Corrective Action**\n\nBased on the investigation findings, the identified root cause is inherent to the manufacturing process and does not impact product safety, efficacy, or quality. Therefore, no formal corrective or preventive action (CAPA) is required.\n\nThe following existing procedural control is confirmed and will be continued to maintain cosmetic quality standards:\n\n*   **Action:** Operators will continue the established practice of manually removing excessive black specks from materials prior to use in the manufacturing process.\n*   **Action Owner:** Manufacturing Operators\n*   **Completion Date:** Not Applicable (This is a continuation of current practice; the action is ongoing).",
  "Preventive Action": "**Preventive Action**\n\nThe following preventive actions have been defined to address the root cause related to the presence of charred polymer particles (black specks) in supplied materials and to prevent recurrence.\n\n1.  **Supplier Process Improvement Engagement**\n    *   **Action:** Engage with the supplier, COMPANY-B, to explore potential improvements in their extrusion process to minimize the generation of charred polymer particles.\n    *   **Owner:** Supplier Quality / Procurement (to initiate and manage engagement).\n    *   **Timing / Status:** This is an ongoing activity with the supplier.\n\n2.  **Enhanced Incoming Material Inspection Procedure**\n    *   **Action:** Implement a procedural update to require that future supplier batch inspections explicitly include a check for excessive charred polymer particles (black specks).\n    *   **Owner:** Quality Control / Quality Assurance.\n    *   **Timing / Status:** To be implemented immediately and maintained on an ongoing basis for each relevant batch.\n\n3.  **Operator Visual Inspection and Rejection Authority**\n    *   **Action:** Update relevant procedures to instruct manufacturing operators to perform a closer visual inspection of material trays for excessive black specks, with the explicit authority to reject non-conforming trays.\n    *   **Owner:** Manufacturing / Quality Assurance.\n    *   **Timing / Status:** To be implemented immediately and maintained on an ongoing basis for each relevant batch.",
  "Investigation Details- Root Cause Analysis - Material": "### **Investigation Details - Root Cause Analysis - Material**\n\nA thorough review of all material-related aspects was performed to determine if material quality, handling, or attributes contributed to the reported deviation. The findings are documented below.\n\n*   **Material Labeling, Testing, and Identification:** All materials involved in the operation were confirmed to be correctly labeled, tested, and identified per their respective specifications.\n*   **Material Specification:** The specifications for all materials used were verified and found to be correct and applicable to the process.\n*   **Certificate of Analysis (CoA):** The Certificate of Analysis for the materials was reviewed and verified to be accurate and compliant with established requirements.\n*   **Condition Upon Receipt:** A review of receiving records and visual inspection logs confirmed that no damage to the materials was noted at the time of receipt.\n*   **Storage Conditions:** All materials were stored in accordance with their defined storage conditions, as documented in the relevant inventory and storage records.\n*   **Expiration/Retest Dating:** The materials utilized were confirmed to be within their approved expiration or retest date period at the time of use.\n*   **Solution Preparation:** The preparation of any solutions from the raw materials was performed appropriately, following the approved procedures.\n\n**Conclusion and Justification:**\nBased on the comprehensive assessment above, material is excluded as a potential root cause for this deviation. The justification for this exclusion is that all material specifications, handling, and storage requirements were fully compliant with established procedures, thereby eliminating material quality or handling as a contributory factor.",
  "Investigation Details- Root Cause Analysis - Method": "### Investigation Details - Root Cause Analysis - Method\n\nThe method/process was evaluated as a potential root cause for the reported event. The analysis included a review of the applicable procedures and their execution.\n\n*   **Applicable Procedures:** The following Standard Operating Procedures (SOPs) were confirmed as relevant and applicable to this event:\n    *   Material Handling (SOP-1234)\n    *   Manufacturing Process Workflow (SOP-5678)\n    *   Quality Control Testing (SOP-9101)\n\n*   **Procedure Gaps:** A review of the aforementioned SOPs was conducted. No gaps, ambiguities, or non-conformances were identified within the procedures themselves.\n\n*   **Calculations:** All calculations associated with the event were verified. No errors in calculation were detected.\n\n**Conclusion:** The method/process is excluded as a root cause. The investigation confirmed that the execution of the activity aligned precisely with the approved procedures listed above, with no deviation from the established methods.",
  "Investigation Details- Root Cause Analysis - Milieu(Environment)": "### **Investigation Details - Root Cause Analysis - Milieu (Environment)**\n\nA formal assessment of environmental factors was performed to determine their potential contribution to the reported deviation.\n\n*   **Natural Disaster Occurrence:** A review of facility logs and external notifications confirmed that no natural disasters (e.g., earthquake, flood, severe storm) occurred during the relevant operational period. This factor is ruled out as a contributory cause.\n\n*   **Temperature Excursion in the Area:** An examination of the continuous monitoring data from the classified area confirmed that all recorded temperature values remained within the validated and specified operational range throughout the entire process. No temperature excursions were identified.\n\n*   **Humidity Excursion in the Area:** An examination of the continuous monitoring data from the classified area confirmed that all recorded relative humidity values remained within the validated and specified operational range throughout the entire process. No humidity excursions were identified.\n\n**Conclusion and Justification:**\nThe environment has been conclusively ruled out as a root or contributory cause. This conclusion is justified by objective evidence demonstrating that all critical environmental parameters (temperature and humidity) were maintained within their specified and validated limits, and no uncontrolled external events occurred. The absence of any recorded environmental excursions during the relevant timeframe provides a sound scientific basis for this determination.",
  "Investigation Details- Root Cause Analysis - Machine": "### **Investigation Details - Root Cause Analysis - Machine**\n\nA comprehensive equipment investigation was performed to determine if the equipment involved was a root cause of the deviation.\n\n**1.0 Equipment Involved**\n*   Mixer Unit 01\n*   Autoclave 02\n\n**2.0 Equipment Setup**\n*   The setup for both Mixer Unit 01 and Autoclave 02 was verified to be correct and in accordance with the approved operating procedures.\n\n**3.0 Equipment Parameters**\n*   Critical operational parameters, including temperature, pressure, and mixing speed, were reviewed and confirmed to be within their specified ranges during the operation in question.\n\n**4.0 Equipment Malfunction**\n*   No equipment malfunctions were reported or identified during the investigation.\n\n**5.0 Operation within Validated Range**\n*   Both Mixer Unit 01 and Autoclave 02 were confirmed to have operated within their validated ranges during the relevant processing steps.\n\n**6.0 Equipment Calibration Status**\n*   A review of calibration records confirmed that all relevant equipment was within its calibration due date at the time of use.\n\n**7.0 Equipment Cleaning Status**\n*   Cleaning documentation was reviewed and confirmed that the equipment was appropriately cleaned and released for use prior to the operation.\n\n**8.0 Conclusion and Justification**\nBased on the evidence collected, equipment has been ruled out as a root cause of the deviation. The justification for this conclusion is that all equipment was functioning properly, maintained in compliance with established protocols (setup, calibration, cleaning), and demonstrated no deviations in operation or performance. This finding directs the investigation toward other potential causal factors."
}